---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FileOpenDialog Properties
FileOpenDialog Class See Also Send Feedback
---

The FileOpenDialog type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | DefaultFilterEntry | The default entry (from the filter) to be selected in the dialog.  (Inherited from FileDialog.) |
|  | Filter | The filter string representing a collection of extensions allowed by the dialog.  (Inherited from FileDialog.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FileDialog.) |
|  | ShowPreview | Identifies if the dialog should include a region showing a preview of the selected file. |
|  | Title | The title to show on the dialog.  (Inherited from FileDialog.) |

# See Also

FileOpenDialog Class

Autodesk.Revit.UI Namespace